app/Controllers/Fundraiser.php

SELECT *
FROM `donations`
WHERE `fund_id` = '4'
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
    public function detail($id){
        $model = new FundraiserModel();
        $donatModel = new DonateModel();
        $userModel = new UserModel();

        $item = $model->where('id', $id)->where('active', 1)->first();
        if(!is_null($item)){

            $data['fund'] = $item;
            $data['donations'] = $donatModel->where('fund_id', $item['id'])->findAll();
            $data['organiser'] = $userModel->where('id', $item['user_id'])->first();

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
    public function donate($id = null){

        $data = [];
        $model = new FundraiserModel();
        $userModel = new UserModel();
        $fundraise = $model->where('id', $id)->first();
        $data['fundraise'] = $fundraise;
        $data['author'] = $userModel->where('id', $fundraise['user_id'])->first();