app/Controllers/Profile.php

    public function login()
    {
        $data = [];

        if ($this->request->getMethod() == 'post') {

            $rules = [
                'email' => 'required|min_length[6]|max_length[50]|valid_email',
                'password' => 'required|min_length[8]|max_length[255]|validateUser[email,password]',
            ];

            $errors = [
                'password' => [
                    'validateUser' => "Email or Password don't match",
                ],
            ];

            if (!$this->validate($rules, $errors)) {

                return view('login', [
                    "validation" => $this->validator,
                ]);

            } else {
                $model = new UserModel();

                $user = $model->where('email', $this->request->getVar('email'))
                    ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'mic.costero@yahoo.com'
 LIMIT 1

    public function funds()
    {
        $data = [];
        $model = new UserModel();
        $fundraiseModel = new FundraiserModel();

        $data['userFunds'] = $fundraiseModel->where('email', session()->get('email'))->findAll();
        $data['user'] = $model->where('id', session()->get('id'))->first();
        $data['inactive'] = $fundraiseModel->where('email', session()->get('email'))->where('active', 0)->findAll();
---
SELECT *
FROM `fundraise`
WHERE `email` = 'mic.costero@yahoo.com'
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `fundraise`
WHERE `email` = 'mic.costero@yahoo.com'
AND `active` = 0

    public function settings($id = null)
    {
        $data = [];

        $model = new UserModel();

        $user = $model->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1